Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/atdf/PIC32CM2532LS60100.atdf
      <value-group name="DSU_DID__FAMILY">
        <value name="1" caption="PIC32CM Ultra-Low Power Entry Level Families" value="1"/>
      </value-group>
      <value-group name="DSU_DID__PROCESSOR">
        <value name="CM23" caption="Cortex-M23" value="0x2"/>
      </value-group>
      <value-group name="DSU_DID__SERIES">
        <value name="LE00" caption="Low Power" value="0x5"/>
        <value name="LS00" caption="Low Power and Security" value="0x6"/>
        <value name="LS60" caption="Low Power and Security with CryptoAuthentication Device" value="0x7"/>
      </value-group>
      <value-group name="DSU_DID__DEVSEL">
        <value name="512KB_64KB_100PIN" caption="512 KB Flash / 64 KB SRAM / 100-pin" value="0x0"/>
        <value name="512KB_64KB_64PIN" caption="512 KB Flash / 64 KB SRAM / 64-pin" value="0x1"/>
        <value name="512KB_64KB_48PIN" caption="512 KB Flash / 64 KB SRAM / 48-pin" value="0x2"/>
        <value name="256KB_32KB_100PIN" caption="256 KB Flash / 32 KB SRAM / 100-pin" value="0x4"/>
        <value name="256KB_32KB_64PIN" caption="256 KB Flash / 32 KB SRAM / 64-pin" value="0x5"/>
        <value name="256KB_32KB_48PIN" caption="256 KB Flash / 32 KB SRAM / 48-pin" value="0x6"/>
        <value name="128KB_16KB_100PIN" caption="128 KB Flash / 16 KB SRAM / 100-pin" value="0x8"/>
        <value name="128KB_16KB_64PIN" caption="128 KB Flash / 16 KB SRAM / 64-pin" value="0x9"/>
        <value name="128KB_16KB_48PIN" caption="128 KB Flash / 16 KB SRAM / 48-pin" value="0xA"/>
      </value-group>
      <value-group name="DSU_CFG__DCCDMALEVEL">
        <value name="EMPTY" caption="Trigger rises when DCC is empty" value="0"/>
        <value name="FULL" caption="Trigger rises when DCC is full" value="1"/>
      </value-group>
    </module>
    <module name="DWT" version="1.0.0" caption="Data Watchpoint and Trace">
      <register-group name="COMPARATOR" size="0x10">
        <register name="DWT_COMP" offset="0x0" rw="RW" size="4" access-size="4" caption="DWT Comparator Register n">
          <bitfield name="VALUE" caption="Cycle/PC/data value or data address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DWT_FUNCTION" offset="0x8" rw="RW" size="4" access-size="4" caption="DWT Function Register x">
          <bitfield name="MATCH" caption="Match type" mask="0xF"/>
          <bitfield name="ACTION" caption="Action on match" mask="0x30"/>
          <bitfield name="DATAVSIZE" caption="Data value size" mask="0xC00"/>
          <bitfield name="MATCHED" caption="Comparator matched" mask="0x1000000"/>
          <bitfield name="ID" caption="Identify capability" mask="0xF8000000"/>
        </register>
      </register-group>
      <register-group name="DWT" caption="Data Watchpoint and Trace">
        <register name="DWT_CTRL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x0B000000" caption="DWT Control Register">
          <bitfield name="CYCCNTENA" caption="CYCCNT enable" mask="0x1"/>
          <bitfield name="POSTPRESET" caption="POSTCNT preset" mask="0x1E"/>
          <bitfield name="POSTINIT" caption="POSTCNT initial" mask="0x1E0"/>
          <bitfield name="CYCTAP" caption="Cycle count tap" mask="0x200"/>
          <bitfield name="SYNCTAP" caption="Synchronization tap" mask="0xC00"/>
          <bitfield name="PCSAMPLENA" caption="PC sample enable" mask="0x1000"/>
          <bitfield name="EXCTRCENA" caption="Exception trace enable" mask="0x10000"/>
          <bitfield name="CPIEVTENA" caption="CPI event enable" mask="0x20000"/>
          <bitfield name="EXCEVTENA" caption="Exception event enable" mask="0x40000"/>
          <bitfield name="SLEEPEVTENA" caption="Sleep event enable" mask="0x80000"/>
          <bitfield name="LSUEVTENA" caption="LSU event enable" mask="0x100000"/>
          <bitfield name="FOLDEVTENA" caption="Fold event enable" mask="0x200000"/>
          <bitfield name="CYCEVTENA" caption="Cycle event enable" mask="0x400000"/>
          <bitfield name="CYCDISS" caption="Cycle counter disabled secure" mask="0x800000"/>
          <bitfield name="NOPRFCNT" caption="No profile counters" mask="0x1000000"/>
          <bitfield name="NOCYCCNT" caption="No cycle count" mask="0x2000000"/>
          <bitfield name="NOEXTTRIG" caption="No external triggers" mask="0x4000000"/>
          <bitfield name="NOTRCPKT" caption="No trace packets" mask="0x8000000"/>
          <bitfield name="NUMCOMP" caption="Number of comparators" mask="0xF0000000"/>
        </register>
        <register name="DWT_PCSR" offset="0x1C" rw="R" size="4" access-size="4" caption="DWT Program Counter Sample Register">
          <bitfield name="EIASAMPLE" caption="Executed instruction address sample" mask="0xFFFFFFFF"/>
        </register>
        <register-group name="COMPARATOR" name-in-module="COMPARATOR" offset="0x020" size="0x10" count="2"/>
        <register name="DWT_LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="DWT Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="DWT_LAR__KEY"/>
        </register>
        <register name="DWT_LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="DWT Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
        <register name="DWT_DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" initval="0x47701A02" caption="DWT Device Architecture Register">
          <bitfield name="ARCHPART" caption="Architecture Part" mask="0xFFF"/>
          <bitfield name="ARCHVER" caption="Architecture Version" mask="0xF000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000"/>
          <bitfield name="PRESENT" caption="DEVARCH Present" mask="0x100000"/>
          <bitfield name="ARCHITECT" caption="Architect" mask="0xFFE00000"/>
        </register>
